Ran Plan for 8 projects:

1. dir: `infra/us-east-1/prod/eks/green/grafana-agent` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/application-secrets` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/eks` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/eks-addons` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `default`
1. dir: `infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db` workspace: `default`
1. dir: `infra/us-east-1/prod/rds/bastion/ec2-instance` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`

### 1. dir: `infra/us-east-1/prod/eks/green/grafana-agent` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/grafana-agent": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/grafana-agent": 
time=2024-02-01T18:39:38Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/eks] 
time=2024-02-01T18:40:14Z level=error msg=chdir /atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/global/route53/records/us-east-2.vpce.grafana.net/.terragrunt-cache/1148634003: no such file or directory
time=2024-02-01T18:40:14Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 2. dir: `infra/us-east-1/prod/eks/green/application-secrets` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/application-secrets": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/application-secrets": 
time=2024-02-01T18:39:38Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/eks] 
time=2024-02-01T18:40:16Z level=error msg=chdir /atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/eks/.terragrunt-cache/4037914495: no such file or directory
time=2024-02-01T18:40:16Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 3. dir: `infra/us-east-1/prod/eks/green/eks` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/eks": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/eks": 
time=2024-02-01T18:40:17Z level=error msg=chdir /atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/vpc/.terragrunt-cache/934230929: no such file or directory
time=2024-02-01T18:40:17Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 4. dir: `infra/us-east-1/prod/eks/green/eks-addons` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/eks-addons": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/eks-addons": 
time=2024-02-01T18:39:37Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/eks] 
╷
│ Error: Required plugins are not installed
│ 
│ The installed provider plugins are not consistent with the packages
│ selected in the dependency lock file:
│   - registry.terraform.io/hashicorp/aws: there is no package for registry.terraform.io/hashicorp/aws 5.34.0 cached in .terraform/providers
│   - registry.terraform.io/hashicorp/kubernetes: there is no package for registry.terraform.io/hashicorp/kubernetes 2.25.2 cached in .terraform/providers
│ 
│ Terraform uses external plugins to integrate with a variety of different
│ infrastructure services. You must install the required plugins before
│ running Terraform operations.
╵
time=2024-02-01T18:40:17Z level=error msg=[/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/prod/eks/green/eks/.terragrunt-cache/3702311166] exit status 1


```
</details>

---
### 5. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/dev/eks/kubevela-addons": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/dev/eks/kubevela-addons": 
time=2024-02-01T18:39:37Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/dev/eks/cluster] 
time=2024-02-01T18:40:18Z level=error msg=chdir /atlantis-data/repos/input-output-hk/sc-dev-platform/126/default/infra/us-east-1/dev/rds/security-group/.terragrunt-cache/1726262040: no such file or directory
time=2024-02-01T18:40:18Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 6. dir: `infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.db_instance.aws_db_instance.this[0] has changed
!   resource "aws_db_instance" "this" {
        id                                    = "db-VMLILTQDTHC74YFBX44NISL4ZU"
!       status                                = "available" -> "stopped"
        # (54 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Changes to Outputs:
+   db_instance_domain_iam_role_name   = ""
!   db_instance_status                 = "available" -> "stopped"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Frds%252Fprod-marlowe-runtime-benchmark-db%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db`
</details>

**Note: Objects have changed outside of Terraform**

---
### 7. dir: `infra/us-east-1/prod/rds/bastion/ec2-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-0588935a949f9ff17" -> "ami-03c951bbe993ea087" # forces replacement
!       arn                                  = "arn:aws:ec2:us-east-1:677160962006:instance/i-018ffd73d7ff9a182" -> (known after apply)
!       associate_public_ip_address          = true -> (known after apply)
!       availability_zone                    = "us-east-1a" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 1 -> (known after apply)
!       disable_api_stop                     = false -> (known after apply)
!       disable_api_termination              = false -> (known after apply)
!       ebs_optimized                        = false -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
!       id                                   = "i-018ffd73d7ff9a182" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
+       instance_lifecycle                   = (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
!       monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       placement_partition_number           = 0 -> (known after apply)
!       primary_network_interface_id         = "eni-022335480577e8250" -> (known after apply)
!       private_dns                          = "ip-10-30-13-155.ec2.internal" -> (known after apply)
!       private_ip                           = "10.30.13.155" -> (known after apply)
!       public_dns                           = "ec2-18-232-130-127.compute-1.amazonaws.com" -> (known after apply)
!       public_ip                            = "18.232.130.127" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
+       spot_instance_request_id             = (known after apply)
!       tags                                 = {
-           "Environment"  = "prod" -> null
            "Name"         = "scde-marlowe-runtime-database-bastion"
-           "Project"      = "scde" -> null
-           "Resource"     = "scde-marlowe-runtime-database-bastion" -> null
-           "Terraform"    = "true" -> null
-           "environment"  = "prod" -> null
-           "function"     = "bastion" -> null
-           "organization" = "iog" -> null
-           "tribe"        = "smart-contracts" -> null
        }
!       tags_all                             = {
-           "Resource"     = "scde-marlowe-runtime-database-bastion" -> null
-           "environment"  = "prod" -> null
-           "function"     = "bastion" -> null
-           "organization" = "iog" -> null
-           "tribe"        = "smart-contracts" -> null
            # (6 unchanged elements hidden)
        }
!       tenancy                              = "default" -> (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
!       vpc_security_group_ids               = [
+           "sg-03a0d7b20aa045f75",
            # (1 unchanged element hidden)
        ]
        # (7 unchanged attributes hidden)

-       capacity_reservation_specification {
-           capacity_reservation_preference = "open" -> null
        }

-       cpu_options {
-           core_count       = 1 -> null
-           threads_per_core = 1 -> null
        }

!       credit_specification {
-           cpu_credits = "standard" -> null
        }

!       enclave_options {
!           enabled = false -> (known after apply)
        }

-       maintenance_options {
-           auto_recovery = "default" -> null
        }

!       metadata_options {
!           instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

-       private_dns_name_options {
-           enable_resource_name_dns_a_record    = false -> null
-           enable_resource_name_dns_aaaa_record = false -> null
-           hostname_type                        = "ip-name" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/xvda" -> null
-           encrypted             = false -> null
-           iops                  = 100 -> null
-           tags                  = {} -> null
-           throughput            = 0 -> null
-           volume_id             = "vol-0c4ac8dc4e3ce03a7" -> null
-           volume_size           = 8 -> null
-           volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   ami                                = "ami-0588935a949f9ff17" -> "ami-03c951bbe993ea087"
!   arn                                = "arn:aws:ec2:us-east-1:677160962006:instance/i-018ffd73d7ff9a182" -> (known after apply)
!   capacity_reservation_specification = [
-       {
-           capacity_reservation_preference = "open"
-           capacity_reservation_target     = []
        },
    ] -> (known after apply)
!   ebs_block_device                   = [] -> (known after apply)
!   ephemeral_block_device             = [] -> (known after apply)
!   id                                 = "i-018ffd73d7ff9a182" -> (known after apply)
!   instance_state                     = "running" -> (known after apply)
!   ipv6_addresses                     = [] -> (known after apply)
!   outpost_arn                        = "" -> (known after apply)
!   password_data                      = "" -> (known after apply)
!   primary_network_interface_id       = "eni-022335480577e8250" -> (known after apply)
!   private_dns                        = "ip-10-30-13-155.ec2.internal" -> (known after apply)
!   private_ip                         = "10.30.13.155" -> (known after apply)
!   public_dns                         = "ec2-18-232-130-127.compute-1.amazonaws.com" -> (known after apply)
!   public_ip                          = "18.232.130.127" -> (known after apply)
!   root_block_device                  = [
-       {
-           delete_on_termination = true
-           device_name           = "/dev/xvda"
-           encrypted             = false
-           iops                  = 100
-           kms_key_id            = ""
-           tags                  = {}
-           throughput            = 0
-           volume_id             = "vol-0c4ac8dc4e3ce03a7"
-           volume_size           = 8
-           volume_type           = "gp2"
        },
    ] -> (known after apply)
!   tags_all                           = {
-       Resource     = "scde-marlowe-runtime-database-bastion"
-       environment  = "prod"
-       function     = "bastion"
-       organization = "iog"
-       tribe        = "smart-contracts"
        # (6 unchanged attributes hidden)
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/rds/bastion/ec2-instance`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Frds%252Fbastion%252Fec2-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/rds/bastion/ec2-instance`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
### 8. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.traitdefinition_nixbuildnet will be created
+   resource "kubectl_manifest" "traitdefinition_nixbuildnet" {
+       api_version             = "core.oam.dev/v1beta1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "TraitDefinition"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "nixbuildnet"
+       namespace               = "vela-system"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: core.oam.dev/v1beta1
            kind: TraitDefinition
            metadata:
              annotations:
                definition.oam.dev/description: Allow an Application to connect to Nixbuild.net
              name: nixbuildnet
              namespace: vela-system
            spec:
              appliesToWorkloads:
              - deployments.apps
              - statefulsets.apps
              - daemonsets.apps
              - jobs.batch
              conflictsWith: []
              podDisruptive: true
              schematic:
                cue:
                  template: "parameter: {\n    secretName?: \"nbn\" | string\n}\n\n#PatchConfig:
                    {\n  nix: {\n    volumes: [{\n        name: \"configmap-nix\"\n        configMap:
                    {\n            defaultMode: 420\n            name: \"cm-\\( context.name )-nix\"\n
                    \       }\n    }]\n    mountPath: \"/etc/nix\"\n    }\n   ssh: {\n    volumes:
                    [{\n        name: \"configmap-ssh\"\n        configMap: {\n            defaultMode:
                    420\n            name: \"cm-\\( context.name )-ssh\"\n        }\n    }]\n
                    \   mountPath: \"/etc/ssh\"\n    }\n}\n\noutputs: {\n    configmapNix: {\n
                    \       apiVersion: \"v1\"\n        data: \"nix.conf\": \"\"\"\n            store
                    = ssh-ng://eu.nixbuild.net\n            experimental-features = nix-command
                    flakes\n            require-sigs = true\n            substituters = https://cache.nixos.org/
                    https://cache.iog.io ssh://eu.nixbuild.net\n            trusted-public-keys
                    = cache.nixos.org-1:6NCHdD59X431o0gWypbMrAURkbJ16ZPMQFGspcDShjY= hydra.iohk.io:f/Ea+s+dFdN+3Y/G+FDgSq+a5NEWhJGzdjvKNGv0/EQ=
                    nixbuild.net/smart.contracts@iohk.io-1:s2PhQXWwsZo1y5IxFcx2D/i2yfvgtEnRBOZavlA8Bog=\n\n
                    \           \"\"\"\n        kind: \"ConfigMap\"\n        metadata: {\n            name:
                    \"cm-\\( context.name )-nix\"\n            namespace: context.namespace\n
                    \       }\n    }\n    configmapSsh: {\n        apiVersion: \"v1\"\n        data:
                    {\n            ssh_config: \"\"\"\n                Host eu.nixbuild.net\n
                    \               PreferredAuthentications none\n                User authtoken\n
                    \               SendEnv token\n\n                Host *\n                AddressFamily
                    any\n                GlobalKnownHostsFile /etc/ssh/ssh_known_hosts\n                \"\"\"\n
                    \           ssh_known_hosts: \"\"\"\n                eu.nixbuild.net ssh-ed25519
                    AAAAC3NzaC1lZDI1NTE5AAAAIPIQCZc54poJ8vqawd8TraNryQeJnvH1eLpIDgbiqymM\n                \"\"\"\n
                    \       }\n        kind: \"ConfigMap\"\n        metadata: {\n            name:
                    \"cm-\\( context.name )-ssh\"\n            namespace: context.namespace\n
                    \       }\n    }\n}\n\npatch: spec: template: spec: {\n\t// +patchKey=name\n\tvolumes:
                    [\n        #PatchConfig.nix.volumes[0],\n        #PatchConfig.ssh.volumes[0]\n
                    \   ]\n\t// +patchKey=name\n    containers: [{\n\t\tname: context.name\n        env:
                    [{\n            name: \"token\"\n            valueFrom: secretKeyRef: {\n
                    \               key: \"token\"\n                name: [\n                    if
                    parameter.secretName != _|_ { parameter.secretName },\n                    \"nbn\"\n
                    \               ][0]\n            }\n        }]\n        volumeMounts: [{\n
                    \           name: #PatchConfig.nix.volumes[0].name\n            mountPath:
                    #PatchConfig.nix.mountPath\n        },{\n            name: #PatchConfig.ssh.volumes[0].name\n
                    \           mountPath: #PatchConfig.ssh.mountPath\n        }]  \n    }]\n}"
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/eks/green/kubevela-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Feks%252Fgreen%252Fkubevela-addons%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/eks/green/kubevela-addons`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`